TandemSoapTester/envelope-template-2.xml

<soapenv:Envelope xmlns:cam="http://campaignInfo.ws.unienr14.tandemservice.ru/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Timestamp wsu:Id="TS-A8414A2DE7F2FBCF9F16218498523299">
                <wsu:Created>{wsu:Created}</wsu:Created>
                <wsu:Expires>{wsu:Expires}</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-A8414A2DE7F2FBCF9F16218498500568">
                <wsse:Username>{wsse:Username}</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{wsse:Password}</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">{wsse:Nonce}</wsse:Nonce>
                <wsu:Created>{wsu:Created}</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <cam:getEnrollmentCampaignList/>
    </soapenv:Body>
</soapenv:Envelope>